Revit 2015 API
MaterialSet.Contains Method
Tests for the existence of a material within the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public virtual bool Contains(
	Material item
)
Visual Basic
Public Overridable Function Contains ( _
	item As Material _
) As Boolean
Visual C++
public:
virtual bool Contains(
	Material^ item
)
Parameters
item
Type: Autodesk.Revit.DB.Material
The material to be searched for.
Return Value
The Contains method returns True if the material is within the set, otherwise False.
See Also
MaterialSet Class
Autodesk.Revit.DB Namespace